EDT/МПСтриж/src/Enums/ВариантыПривязкиТелефона/ВариантыПривязкиТелефона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыПривязкиТелефона</name>
  <enumValues>
    <name>КВодителю</name>
  </enumValues>
  <enumValues>
    <name>КТранспорту</name>
  </enumValues>
</mdclass:Enum>

EDT/МПСтриж/src/Catalogs/Транспорт/Транспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Транспорт</name>
  <predefined>
    <items>
      <name>ПустойТранспорт</name>
      <description>Пустой транспорт</description>
    </items>
  </predefined>
  <attributes>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/МПСтриж/src/CommonForms/АвторизацияСВыборомТранспорта/Module.bsl
&НаКлиенте
Процедура ОК(Команда)
	Пр = Получитьпароль();
	Если Пароль = Пр  Тогда     //И Не Транспорт.Пустая()
		Авторизован = Истина;
		УстановитьТранспортНаСервере();
		Если Не Админ Тогда
			ОбщегоНазначения.СохранитьДанныеАвтологина(Пароль);
		КонецеСли;			
		Закрыть("Ok");
	Иначе
		Предупреждение("Неверный пароль!");
	КонецеСли;	
КонецПроцедуры

Процедура УстановитьТранспортНаСервере()
	Если Не Транспорт.Пустая() Тогда
		Константы.Транспорт.Установить(Транспорт);
	КонецеСли;	
КонецПроцедуры	

Функция ПолучитьПароль() Экспорт
	Если Админ Тогда
		Возврат Константы.ПарольАдмина.Получить();
	Иначе	
		Возврат Константы.Пароль.Получить();
	КонецеСли;	
КонецФункции

Функция ВернутьИмя()
	Если Не Админ Тогда
		Если Константы.ВариантПривязкиТелефона.Получить() = Перечисления.ВариантыПривязкиТелефона.КВодителю Тогда
			Возврат СокрЛП(Константы.Водитель.Получить().Наименование);
		ИначеЕсли Константы.ВариантПривязкиТелефона.Получить() = Перечисления.ВариантыПривязкиТелефона.КТранспорту Тогда	
			Возврат СокрЛП(Константы.Транспорт.Получить().Наименование);
		КонецеСли;	
	Иначе
		Возврат "Администратор";
	КонецеСли;
КонецФункции	


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Константы.НомерТелефона.Получить()) Тогда
		Заголовок = Константы.НомерТелефона.Получить();
	Иначе	
		Заголовок = "Авторизация";
	конецеСли;
	
	Если Не Админ Тогда
		Админ = Параметры.Администратор;
	КонецеСли;	
	
	Транспорт = Константы.Транспорт.Получить();
	Регион = Константы.ТекущийРегион.Получить();
	
	Если Регион.Пустая() Тогда
		Элементы.Транспорт.СписокВыбора.Добавить(Справочники.Транспорт.ПустойТранспорт);
	Иначе
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		            |	Транспорт.Ссылка КАК Транспорт
		            |ИЗ
		            |	Справочник.Транспорт КАК Транспорт
		            |ГДЕ
		            |	Транспорт.Регион = &Регион
		            |	И Транспорт.ПометкаУдаления = ЛОЖЬ
		            |
		            |УПОРЯДОЧИТЬ ПО
		            |	Транспорт.Наименование";
		Зап.УстановитьПараметр("Регион", Регион);
		Выб = Зап.Выполнить().Выбрать();
		
		Пока Выб.Следующий() Цикл
			Элементы.Транспорт.СписокВыбора.Добавить(Выб.Транспорт);
		КонецЦикла;	
	КонецеСли;	
		
КонецПроцедуры


Функция ПолучитьТелефонЛогиста() Экспорт
	//Возврат Константы.ТелефонЛогиста.Получить();
	Возврат Константы.ТекущийРегион.Получить().НомерТелефонаСтаршегоЛогиста;
КонецФункции



&НаКлиенте
Процедура ЗвонокЛогисту(Команда)
	Тел = ПолучитьТелефонЛогиста();                                                                                       
	если Не ЗначениеЗаполнено(Тел) Тогда
		Предупреждение("Не указан телефон логиста!");
		Возврат;
	КонецеСли;	
	ЗапуститьПриложение("tel:" + Тел);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИмяПользователя = ВернутьИмя();
	если Админ Тогда
		Элементы.ЗвонокЛогисту.Видимость = ложь;
	КонецеСлИ;	
КонецПроцедуры
